In [9]:
import numpy as np
import pandas as pd

In [10]:
df=pd.read_csv("/workspaces/Ravi-kumar-svce/Machine learning/Tokyo_Medals_2021.csv")
df

,Country,Gold Medal,Silver Medal,Bronze Medal,Total,Rank By Total
0,United States of America,39,41,33,113,1
1,People's Republic of China,38,32,18,88,2
2,Japan,27,14,17,58,5
3,Great Britain,22,21,22,65,4
4,ROC,20,28,23,71,3
...,...,...,...,...,...,...
88,Ghana,0,0,1,1,77
89,Grenada,0,0,1,1,77
90,Kuwait,0,0,1,1,77
91,Republic of Moldova,0,0,1,1,77
92,Syrian Arab Republic,0,0,1,1,77

In [11]:
df['Total'].mean()

11.612903225806452

In [12]:
np.average(df['Bronze Medal'],weights=df['Total'])

13.83611111111111

In [16]:
from scipy.stats import trim_mean
trim_mean(df['Gold Medal'],0.1)

1.96

In [20]:
df['Total'].median()

4.0

In [21]:
df.describe()

       Gold Medal  Silver Medal  Bronze Medal       Total  Rank By Total
count   93.000000     93.000000     93.000000   93.000000      93.000000
mean     3.655914      3.634409      4.322581   11.612903      43.494624
std      7.022471      6.626339      6.210372   19.091332      24.171769
min      0.000000      0.000000      0.000000    1.000000       1.000000
25%      0.000000      0.000000      1.000000    2.000000      23.000000
50%      1.000000      1.000000      2.000000    4.000000      47.000000
75%      3.000000      4.000000      5.000000   11.000000      66.000000
max     39.000000     41.000000     33.000000  113.000000      77.000000